Public Attributes | List of all members
ACAPI::MEP::RouteConnectionResult Struct Reference
MEP Element Manager
Defines the changes regarding Ids after a RoutingElement-RoutingElement connection. More...
#include <MEPTypes.hpp>
 Public Attributes
 std::optional< UniqueID >  | deletedRoutingElementId
If there was a merge, it contains the id of the deleted RoutingElement.
 std::optional< UniqueID >  | splittedRoutingElementId
If there was a splitting, it contains the id of the newly created RoutingElement.
 std::optional< UniqueID >  | createdBranchId
If there was a splitting, it contains the id of the newly created branch.
Detailed Description
Defines the changes regarding Ids after a RoutingElement-RoutingElement connection.